Repository: Armand-Duval/VocabFlow
Catalog: Shared/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

# deck.import.emptyFile
source: The file is empty or still downloading from iCloud. Open Files, wait for the download to finish, then try again.
zh_hans: 文件为空或 iCloud 尚未下载完成。请在「文件」中等待下载完成后再试。

# deck.import.failed
source: Import Failed
zh_hans: 导入失败

# deck.import.fallback.incompleteName
source: Anki Import (Incomplete)
zh_hans: Anki 导入（字段不完整）

# deck.import.fallback.unmappedName
source: Anki Import (Unknown Deck)
zh_hans: Anki 导入（未知词库）

# deck.import.intoSelectedDecksResult
source: Imported into %1$d deck(s): %2$d added, %3$d updated.
zh_hans: 已导入到 %1$d 个词库：新增 %2$d 张，更新 %3$d 张。

# deck.import.invalidJSON
source: This JSON file is not a supported KnoWell format.
zh_hans: 这不是 KnoWell 支持的 JSON 格式。

# deck.import.missingBackPlaceholder
source: (No back field)
zh_hans: （无背面字段）

# deck.import.needSelectionForNoDeckInfo
source: This file has no deck info. Select one or more decks, then import again.
zh_hans: 该文件不含词库信息，请先选择一个或多个词库后再导入。

# deck.import.needSingleOrNoneForBackup
source: Select one deck to import into it, deselect all for a full-library restore, or select all decks to replace everything.
zh_hans: 请只选 1 个词库导入到该词库，或取消全选以恢复整个词库，或全选后替换全部。

# deck.import.needSingleSelection
source: Select exactly one deck for JSON pack / Anki import. Full backups offer merge or replace.
zh_hans: 词库包或 Anki 导入请只选 1 个词库。完整备份文件会提示合并或覆盖。

# deck.import.pack
source: Import Deck Pack (.json)
zh_hans: 导入词库包 (.json)

# deck.import.packResult
source: Imported %2$d cards into %1$@.
zh_hans: 已向「%1$@」导入 %2$d 张卡片。

# deck.import.replaceDeckResult
source: Replaced contents of “%1$@” with %2$lld cards.
zh_hans: 已用 %2$lld 张卡片替换「%1$@」的内容。

# deck.import.section
source: Import
zh_hans: 导入

# deck.import.wrongFormatBackup
source: This is a KnoWell backup file. Use Restore backup instead of Import pack.
zh_hans: 这是 KnoWell 备份文件，请用「恢复备份」而不是「导入词库包」。

# deck.import.wrongFormatHintBackup
source: JSON format mismatch. Restore backup needs a KnoWell backup (.json with exportedAt). Deck packs should use Import pack.
zh_hans: JSON 格式不匹配。恢复备份需要含 exportedAt 的 KnoWell 备份；词库包请用「导入词库包」。

# deck.import.wrongFormatHintPack
source: JSON format mismatch. Import pack needs a deck pack (.json with name + cards). Backups should use Restore backup.
zh_hans: JSON 格式不匹配。导入词库包需要含 name 和 cards 的词库包；完整备份请用「恢复备份」。

# deck.import.wrongFormatPack
source: This is a deck pack file. Use Import pack instead of Restore backup.
zh_hans: 这是词库包文件，请用「导入词库包」而不是「恢复备份」。

# deck.importing
source: Importing…
zh_hans: 正在导入…

# deck.importMode.message
source: Merge updates matching IDs in “%@” and appends new cards. Replace clears only that deck first. Other decks are not affected.
zh_hans: 合并：在「%@」中同 ID 更新并追加新卡片。替换：仅清空该词库后导入，其他词库不受影响。

# deck.importMode.replace
source: Replace deck contents
zh_hans: 替换该词库内容

# deck.importMode.title
source: Import into deck
zh_hans: 导入到词库

# deck.install.complete
source: Deck Added
zh_hans: 词库已添加

# deck.install.empty
source: “%@” is already in your library.
zh_hans: 「%@」已在词库中

# deck.install.failed
source: Could Not Add Deck
zh_hans: 添加词库失败

# deck.install.withCards
source: Downloaded “%1$@”, %2$d cards.
zh_hans: 已下载「%1$@」，%2$d 张

# deck.installing
source: Installing…
zh_hans: 正在添加…

# deck.loading
source: Loading decks…
zh_hans: 正在加载词库…

# deck.manage
source: Manage Decks
zh_hans: 管理词库

# deck.manage.short
source: Manage
zh_hans: 管理

# deck.myDecks
source: My Decks
zh_hans: 我的词库

# deck.name.placeholder
source: Deck name
zh_hans: 词库名称

# deck.openSource.footer
source: Downloaded from GitHub. Requires network. NGSL/NAWL are CC BY-SA 4.0; TOEFL dataset is MIT.
zh_hans: 从 GitHub 在线下载，需联网。NGSL/NAWL 为 CC BY-SA 4.0；TOEFL 数据集为 MIT。

# deck.openSource.section
source: Open Source Decks
zh_hans: 开源词库

# deck.originalPack.empty
source: No original download is saved yet. Import an Anki package or download a catalog pack first.
zh_hans: 还没有保存过原始下载包。先导入 Anki 包，或从目录下载一个词库。

# deck.originalPack.open
source: Open original downloads
zh_hans: 打开原始下载包

# deck.originalPack.saved
source: Original file kept as-is: %@ SHA256 %@ Files → KnoWell → OriginalPacks
zh_hans: 原文件已原样保存：%@ SHA256 %@ 文件 → 致知 → OriginalPacks

# deck.preparingExport
source: Preparing file…
zh_hans: 正在准备文件…

# deck.preset.add
source: Add
zh_hans: 添加

# deck.preset.customReading.detail
source: A flexible deck for anything you are reading.
zh_hans: 任意阅读材料的通用收集词库。

# deck.preset.customReading.name
source: Free Reading
zh_hans: 泛读收集

# deck.preset.economist.detail
source: 18 Economist-style words and phrases to get started. Add more while reading.
zh_hans: 内置 18 个经济学人风格高频词 starter，阅读时可继续添加。

# deck.preset.economist.name
source: The Economist Reading
zh_hans: 经济学人阅读

# deck.preset.footer
source: Small starter packs built into the app. For full lists, use Open Source or Community sections below.
zh_hans: 内置少量 starter 词快速上手。完整词库请见下方「开源词库」或「社区词库」。

# deck.preset.gre.detail
source: 20 high-frequency GRE words (starter, not the full Red Book). Import .apkg for the full list.
zh_hans: 20 个 GRE 高频词 starter（非完整红宝书）。完整词表请导入 .apkg。

# deck.preset.gre.name
source: GRE High Frequency
zh_hans: GRE 高频词

# deck.preset.ielts.detail
source: 20 core IELTS vocabulary words to get started. Import .apkg for the full list.
zh_hans: 20 个雅思核心词汇 starter。完整词表请导入 .apkg。

# deck.preset.ielts.name
source: IELTS Core
zh_hans: 雅思核心词汇

# deck.preset.installed
source: Added
zh_hans: 已添加

# deck.preset.poorCharlies.detail
source: Core Munger concepts and vocabulary while reading the book.
zh_hans: 阅读《穷查理宝典》时的核心概念与生词。

# deck.preset.poorCharlies.name
source: Poor Charlie's Almanack
zh_hans: 穷查理宝典

# deck.preset.section
source: Recommended Decks
zh_hans: 推荐词库

# deck.preset.starterCount
source: %lld words
zh_hans: %lld 词

# deck.quick.exportAction
source: Quick export
zh_hans: 快速导出

# deck.quick.exportApkg
source: Export Anki
zh_hans: 导出 Anki

# deck.quick.exportDeckApkg
source: Export Anki
zh_hans: 导出 Anki

# deck.quick.exportDeckJSON
source: Export JSON
zh_hans: 导出 JSON

# deck.quick.exportJSON
source: Save backup
zh_hans: 保存备份

# deck.quick.importApkg
source: Import Anki
zh_hans: 导入 Anki

# deck.quick.importBackup
source: Restore
zh_hans: 恢复备份

# deck.quick.importJSON
source: Import JSON
zh_hans: 导入 JSON

# deck.quick.importPack
source: Import pack
zh_hans: 导入词库包

# deck.remote.license
source: License: %@
zh_hans: 协议：%@

# deck.remote.nawl.detail
source: 963 academic headwords only — no definitions or example sentences.
zh_hans: 963 个学术词目，源文件只有词和词形，没有释义和例句。

# deck.remote.nawl.name
source: NAWL Academic English
zh_hans: NAWL 学术英语

# deck.remote.ngsl.detail
source: 2,809 core words with easy-English definitions. No example sentences in the source.
zh_hans: 2809 个核心词，只有简易英文释义，源文件没有例句。

# deck.remote.ngsl.name
source: NGSL General English
zh_hans: NGSL 通用英语

# deck.remote.toefl.detail
source: English definition + example sentence + synonyms. No Chinese in the source.
zh_hans: 有英文释义、例句和近义词。源文件没有中文。

# deck.remote.toefl.name
source: TOEFL / IELTS Academic 1000
zh_hans: 托福/雅思学术 1000 词

# deck.remote.viewSource
source: View source & attribution
zh_hans: 查看来源与署名

# deck.save
source: Save
zh_hans: 保存

# deck.section
source: Target Deck
zh_hans: 目标词库

# deck.section.footer
source: New cards will be saved to this deck. Manage or download more decks anytime.
zh_hans: 新生成的卡片会保存到此词库。可随时管理或下载更多词库。

# deck.selectAll
source: Select all
zh_hans: 全选

# deck.selectedExportHint
source: %d deck(s) selected — ready to export
zh_hans: 已选中 %d 个词库，可直接导出

# deck.singleDeck.footer
source: Actions apply to “%1$@”. JSON import supports v1/v2 backup and deck pack files.
zh_hans: 操作作用于「%1$@」。JSON 支持 v1/v2 备份与词库包格式。

# deck.singleDeck.noSelection
source: Select a deck above first.
zh_hans: 请先在上方选择一个词库。

# deck.singleDeck.section
source: Selected deck
zh_hans: 当前词库

# deck.statistics.due
source: Due today
zh_hans: 今日待复习

# deck.statistics.learned
source: Learned
zh_hans: 已学习

# deck.statistics.mastery
source: Mastery
zh_hans: 掌握率

# deck.statistics.new
source: New
zh_hans: 未学习

# deck.statistics.overview
source: Overview
zh_hans: 概览

# deck.statistics.total
source: Total cards
zh_hans: 总卡片数

# deck.store.title
source: Decks
zh_hans: 词库

# deck.target
source: Deck
zh_hans: 词库

# deck.totalCards.short
source: total
zh_hans: 总

# deck.untitled
source: Untitled Deck
zh_hans: 未命名词库

# error.invalidResponse
source: AI returned an invalid response.
zh_hans: AI 返回了无效响应。

# error.missingAPIKey
source: Add an API key in Settings, or use the built-in cloud AI.
zh_hans: 请先在「设置」中填写 API Key，或使用内置云端 AI。

# error.parse
source: Failed to parse cards: %@
zh_hans: 解析卡片失败：%@

# extension.error.missingKey
source: AI is not configured
zh_hans: 未配置 AI

# extension.error.noContent
source: No shared content received
zh_hans: 没有收到分享内容

# extension.error.noText
source: Could not read text. Copy it and open KnoWell instead.
zh_hans: 未读到文字内容，请用「拷贝」后打开 KnoWell

# extension.error.ocrFailed
source: Could not read text from the image. Try a clearer photo or paste the text.
zh_hans: 未能从图片识别文字，请换更清晰的图或直接粘贴文本

# extension.error.timeout
source: Loading timed out. Copy the text and open KnoWell instead.
zh_hans: 读取超时，请复制文本后打开 KnoWell

# extension.error.title
source: Cannot Submit
zh_hans: 无法提交

# extension.handedOff
source: Continue
zh_hans: 继续制卡

# extension.handedOff.hint
source: Tap Open KnoWell. If it does not jump, tap the notification at the top.
zh_hans: 点「打开致知」。若没有跳转，再点屏幕上方的通知。

# extension.handedOff.reason
source: Photos are recognized in the app.
zh_hans: 图片在致知里识别制卡。

# extension.hint
source: Reading…
zh_hans: 正在读取…

# extension.openApp
source: Open KnoWell
zh_hans: 打开致知

# extension.openingCreate
source: Opening KnoWell…
zh_hans: 正在打开致知…

# extension.wordsFooter
source: Add at least one word. You'll be notified when generation finishes.
zh_hans: 至少填写一个生词。生成结果将通过通知告知。

# home.recentDecks
source: Recent
zh_hans: 最近词库

# home.stat.due
source: Due today
zh_hans: 今日待复习

# home.stat.newQuota
source: New quota
zh_hans: 新词配额

# home.stat.streak
source: Streak
zh_hans: 连续学习

# home.stat.streakValue
source: %lld d
zh_hans: %lld 天

# home.stat.totalDays
source: Studied %lld days
zh_hans: 已学 %lld 天

# import.camera
source: Take photo
zh_hans: 拍照识别

# import.camera.success
source: Text recognized from camera
zh_hans: 已从拍照识别文字

# import.clipboard.both
source: Imported from clipboard
zh_hans: 已从剪贴板导入

# import.clipboard.sentence
source: Imported from clipboard
zh_hans: 已从剪贴板导入

# import.clipboard.word
source: Word detected
zh_hans: 已识别生词

# import.ocr.empty
source: No text found. Try a clearer screenshot.
zh_hans: 未识别到文字，请换一张更清晰的截图

# import.ocr.failed
source: Could not read the image
zh_hans: 无法读取图片

# import.ocr.highlightContext
source: Imported %d word(s) from %d sentence(s)
zh_hans: 已导入 %d 个高亮词（%d 句）

# import.ocr.highlightDetected
source: Recognized %d highlighted word(s)
zh_hans: 已识别 %d 个高亮词

# import.ocr.vocabPage
source: Picked %d headword(s) from the page
zh_hans: 已抽出 %d 个词头，可删减后制卡

# import.photo
source: Recognize screenshot
zh_hans: 从相册识别截图

# import.photo.recognizing
source: Recognizing text…
zh_hans: 正在识别文字…

# import.photo.success
source: Text recognized from image
zh_hans: 已从图片识别文字

# import.share.both
source: Imported from share
zh_hans: 已导入分享内容

# import.share.sentence
source: Imported from share
zh_hans: 已导入分享内容

# interval.days
source: %dd
zh_hans: %d 天

# interval.hours
source: %dh
zh_hans: %d 小时

# interval.minutes
source: %dm
zh_hans: %d 分钟

# library.autoBackup.banner
source: Today’s auto backup is ready (JSON + Anki). Tap to open AutoBackup in Files.
zh_hans: 今日自动备份已完成（JSON + Anki）。点按可打开「文件」中的 AutoBackup。

# library.autoBackup.banner.openHint
source: Opens the AutoBackup folder in the Files app.
zh_hans: 在「文件」App 中打开 AutoBackup 文件夹。

# library.contextNote
source: Sentence translation
zh_hans: 句子翻译

# library.deleteCard
source: Delete Card
zh_hans: 删除卡片

# library.deleteCard.message
source: This action cannot be undone.
zh_hans: 此操作无法撤销。

# library.detail.content
source: Content
zh_hans: 内容

# library.detail.srs
source: Review Stats
zh_hans: 复习数据

# library.due
source: Due
zh_hans: 待复习

# library.edit
source: Edit
zh_hans: 编辑

# library.edit.backFooter
source: Shown after flip: sense/explanation, then sentence translation. Highlight gloss marks only the target word’s short translation.
zh_hans: 翻面后看到的内容：释义及解释，以及句子翻译。高亮译法只标目标词对应的短译。

# library.edit.backSection
source: Back
zh_hans: 反面

# library.edit.basics
source: Basics
zh_hans: 基本信息

# library.edit.frontFooter
source: What you see first in review. Source text is the original sentence; Front is the card face (cloze blank or full sentence).
zh_hans: 复习时先看到的一面。原文是完整例句，正面是卡片正面内容（挖空句或完整原句）。

# library.edit.frontSection
source: Front
zh_hans: 正面

# library.edit.title
source: Edit · %@
zh_hans: 编辑 · %@

# library.empty.goCreate
source: Go to Create tab to paste text or use OCR and generate your first cards.
zh_hans: 前往「制卡」粘贴文本或拍照识别，生成你的第一批卡片。

# library.empty.message
source: Saved cards will appear here.
zh_hans: 保存卡片后会显示在这里。

# library.empty.title
source: Library is empty
zh_hans: 词库为空

# library.filter.all
source: All cards
zh_hans: 全部卡片

# library.filter.appreciation
source: Appreciation
zh_hans: 赏析卡

# library.filter.cloze
source: Cloze cards
zh_hans: 挖空卡

# library.filter.definition
source: Definition cards
zh_hans: 释义卡

# library.filter.due
source: Due for review
zh_hans: 待复习

# library.filter.menu
source: Filter
zh_hans: 筛选

# library.filter.title
source: Filter
zh_hans: 筛选

# library.flatList.hint
source: Large deck — showing a flat list for faster scrolling. Use the menu to switch to grouped view.
zh_hans: 词库较大，已切换为扁平列表以提升滚动性能。可通过菜单切回分组视图。

# library.migrate
source: Move to…
zh_hans: 迁移到…

# library.migrate.done
source: Moved %d cards to “%@”
zh_hans: 已将 %d 张卡片移至「%@」

# library.migrate.title
source: Move to Deck
zh_hans: 迁移到词库

# library.nextReview
source: Next: %@
zh_hans: 下次：%@

# library.noResults.message
source: Try searching for another word, sentence, or card content.
zh_hans: 试试搜索其他生词、原句或卡片内容。

# library.noResults.title
source: No results
zh_hans: 未找到结果

# library.quick.export
source: Export
zh_hans: 导出

# library.quick.import
source: Import
zh_hans: 导入

# library.resetSRS
source: Reset Review Progress
zh_hans: 重置复习进度

# library.resetSRS.message
source: This card will be treated as new. Review history for this card will be cleared.
zh_hans: 该卡片将恢复为新卡状态，复习记录会被清除。

# library.reviewAll
source: Review all %2$lld cards for "%1$@"
zh_hans: 复习「%1$@」全部 %2$lld 张

# library.reviewDeck
source: Review %1$@ (%2$d due)
zh_hans: 复习「%1$@」（%2$d 张到期）

# library.reviewThisCard
source: Review This Card
zh_hans: 复习此卡

# library.search
source: Search
zh_hans: 搜索

# library.select
source: Select
zh_hans: 选择

# library.select.done
source: Done
zh_hans: 完成

# library.selectedCount
source: %d selected
zh_hans: 已选 %d 张

# library.srs.ease
source: Ease
zh_hans: 难度系数

# library.srs.interval
source: Interval
zh_hans: 间隔

# library.srs.new
source: New
zh_hans: 新卡

# library.srs.nextReview
source: Next Review
zh_hans: 下次复习

# library.srs.reviewCount
source: Reviews
zh_hans: 复习次数

# library.srs.scheduled
source: Scheduled
zh_hans: 已排期

# library.srs.status
source: Status
zh_hans: 状态

# library.title
source: Library
zh_hans: 词库

# library.view.flat
source: Flat List
zh_hans: 扁平列表

# library.view.grouped
source: Grouped
zh_hans: 分组显示

# liveText.addWord
source: Add word
zh_hans: 加入生词

# liveText.detectingHighlights
source: Finding highlighted words…
zh_hans: 正在识别荧光笔生词…

# liveText.highlightsDetected
source: Added %lld highlighted word(s). Tap to add more, or tap × to remove.
zh_hans: 已自动加入 %lld 个荧光笔生词，可点选补充或点 × 删除。

# liveText.hint
source: Highlighter words are added automatically.
zh_hans: 荧光笔词自动加入

# liveText.imageSelected
source: Using the picture as the memory cue.
zh_hans: 将用图片作为记忆载体

# liveText.imported
source: Added %lld word(s) from the page
zh_hans: 已从页面加入 %lld 个生词

# liveText.optional.label
source: Source · optional
zh_hans: 原文 · 可选

# liveText.optional.note
source: Use selection as source: your selection. Use image as memory cue: the picture.
zh_hans: 用框选作原文：框选内容。用图片作为记忆载体：这张图。

# liveText.sourceHelp
source: Skip both: auto-detect full sentences from the page. · Use selection as source: split full sentences only from what you framed. · Use this image: use the picture as the memory cue.
zh_hans: 都不点：从整页自动识别整句。 · 用框选作原文：只在框选范围内拆出整句。 · 用这张图：用图片作为记忆载体。

# liveText.sourceHelp.title
source: About source text
zh_hans: 原文说明

# liveText.sourceUpdated
source: Using your selection as the source
zh_hans: 将使用框选内容作为原文

# liveText.title
source: Select text
zh_hans: 点选文字

# liveText.toggleHighlights
source: Show selectable text
zh_hans: 显示可点选的文字

# liveText.useAsSource
source: Use as source
zh_hans: 用作原文

# liveText.useImage
source: Use this image
zh_hans: 用这张图

# liveText.useSelection
source: Use selection as source
zh_hans: 用框选作原文

# liveText.useSentence
source: Use this sentence
zh_hans: 用这句话

# membership.anki.body
source: Anki import/export is a Pro perk. Membership checkout is coming soon; you can continue during the limited preview.
zh_hans: Anki 导入/导出为会员权益。开通流程即将上线；限时预览期内可继续使用。

# membership.anki.title
source: Member feature
zh_hans: 会员功能

# membership.badge
source: Pro
zh_hans: 会员

# membership.continueLimited
source: Continue for now
zh_hans: 继续使用

# notification.failed
source: Generation failed: %@
zh_hans: 生成失败：%@

# notification.generating
source: Generating cards in the background. You'll be notified when ready.
zh_hans: 正在后台生成卡片，完成后会通知你

# notification.ready
source: Generated %lld cards. Open KnoWell to preview and save.
zh_hans: 已生成 %lld 张卡片，打开 KnoWell 预览并保存

# notification.ready.generic
source: Shared content saved. Open KnoWell to continue.
zh_hans: 分享内容已保存，点击继续制卡

# notification.saved
source: Saved %lld cards to your library. Ready to review.
zh_hans: 已保存 %lld 张卡片到词库，可以开始复习

# notification.shareInbox
source: Photo is too large. Tap to open KnoWell.
zh_hans: 原图太大，点这里打开致知

# onboarding.back
source: Back
zh_hans: 返回

# onboarding.body
source: Paste any text, generate cards with AI, and review with spaced repetition.
zh_hans: 粘贴任意文本，AI 生成卡片，用间隔重复记住。

# onboarding.continue
source: Continue
zh_hans: 继续

# onboarding.headline
source: Turn reading into memory
zh_hans: 摘录所读，记住所得

# onboarding.point.capture
source: Capture sentences from Safari, photos, or paste
zh_hans: 从 Safari、照片或粘贴摘录句子

# onboarding.point.remember
source: FSRS scheduling adapts to how well you remember
zh_hans: FSRS 调度会随记忆表现调整间隔

# onboarding.point.review
source: Review due cards first every time you open the app
zh_hans: 打开 App 先复习今日到期卡片

# preview.back
source: Meaning
zh_hans: 释义及解释

# preview.back.placeholder
source: Part of speech + meaning in this sentence
zh_hans: 词性 + 结合语境的释义

# preview.front
source: Front
zh_hans: 正面

# preview.include
source: Save to library
zh_hans: 加入词库

# preview.intro
source: Review and edit AI-generated cards before saving to your library.
zh_hans: 预览并编辑 AI 生成的卡片，确认后保存到词库。

# preview.phonetic
source: Phonetic
zh_hans: 音标

# preview.phonetic.placeholder
source: /phonetic/
zh_hans: /音标/

# preview.save
source: Save %lld
zh_hans: 保存 %lld 张

# preview.save.allDuplicates.message
source: Selected cards already exist in this deck for the same word and sentence.
zh_hans: 所选卡片的词与句子在该词库中已存在。

# preview.save.allDuplicates.title
source: Already in deck
zh_hans: 词库中已有

# preview.save.partialDuplicates
source: Saved %lld cards, skipped %lld duplicates.
zh_hans: 已保存 %lld 张，跳过 %lld 张重复。

# preview.saved.message
source: Cards were added to your library. Open Review to start studying.
zh_hans: 卡片已加入词库，可以去「复习」标签开始记忆。

# preview.saved.title
source: Saved
zh_hans: 已保存

# preview.title
source: Preview
zh_hans: 预览

# preview.type
source: Type
zh_hans: 类型

# preview.word
source: Word
zh_hans: 生词

# privacy.accept
source: Agree and continue
zh_hans: 同意并继续

# privacy.ai.body
source: When you generate cards, source text and vocabulary are sent to the AI provider using your API key. We do not operate a backend that stores your content.
zh_hans: 生成卡片时，原文与生词会通过你的 API Key 发送至 AI 服务商。应用不提供存储内容的后端服务。

# privacy.ai.title
source: AI Generation (BYOK)
zh_hans: AI 制卡（自带 Key）

# privacy.consent.body
source: Cards stay on your device. AI generation sends only the text you choose to your configured API provider.
zh_hans: 卡片保存在本机。仅在你主动制卡时，把所选文本发送到你配置的 AI 服务商。

# privacy.consent.title
source: Privacy
zh_hans: 隐私说明

# privacy.contact.body
source: Please contact the developer via the support details on the App Store product page. This policy may be updated as features change.
zh_hans: 请通过 App Store 产品页的支持信息联系开发者。随功能迭代，本政策可能更新。继续使用即表示接受修订后的政策。

# privacy.contact.title
source: Updates
zh_hans: 政策更新

# privacy.data.body
source: Cards, review schedules, and settings are stored locally on your iPhone. JSON backups you export are under your control.
zh_hans: 卡片、复习计划与设置均保存在 iPhone 本地。导出的 JSON 备份由你自行管理。

# privacy.data.title
source: Data We Store
zh_hans: 本地存储

# privacy.intro
source: KnoWell stores your flashcards on device. This summary explains how data is handled.
zh_hans: KnoWell 将闪卡数据保存在本机。以下为数据处理方式摘要。

# privacy.ocr.body
source: Photo and share-image OCR runs on device with Apple Vision. Images are not uploaded for recognition.
zh_hans: 相册与分享图片的文字识别在设备本地通过 Apple Vision 完成，图片不会上传识别。

# privacy.ocr.title
source: OCR
zh_hans: 文字识别

# privacy.storage.body
source: Your API key is stored in the App Group shared container so extensions can generate cards. Treat your device passcode and backups accordingly.
zh_hans: API Key 保存在 App Group 共享容器中，以便扩展制卡。请妥善保护设备密码与备份。

# privacy.storage.title
source: API Keys
zh_hans: API Key

# privacy.title
source: Privacy Policy
zh_hans: 隐私政策

# rating.again
source: Forgot
zh_hans: 忘记

# rating.again.interval
source: <1 day
zh_hans: <1 天

# rating.appreciation.again
source: Read again
zh_hans: 还想再读

# rating.appreciation.easy
source: Familiar
zh_hans: 已熟悉

# rating.appreciation.good
source: Resonates
zh_hans: 有印象

# rating.appreciation.hard
source: Recognized
zh_hans: 有印象

# rating.easy
source: Easy
zh_hans: 很熟

# rating.easy.interval
source: ~7 days
zh_hans: 约 7 天

# rating.good
source: Good
zh_hans: 良好

# rating.good.interval
source: ~3 days
zh_hans: 约 3 天

# rating.hard
source: Fuzzy
zh_hans: 模糊

# rating.hard.interval
source: ~1 day
zh_hans: 约 1 天

# review.aiInsight
source: AI insight
zh_hans: AI拓展解读

# review.appreciation
source: Appreciation
zh_hans: 赏析

# review.appreciation.empty
source: The appreciation text wasn't generated.
zh_hans: 赏析正文没有生成。

# review.appreciation.theme
source: Theme
zh_hans: 主题

# review.card.back
source: Back
zh_hans: 背面

# review.card.front
source: Front
zh_hans: 正面

# review.collapseAnswer
source: Collapse answer
zh_hans: 收起解析

# review.collapseModules
source: Collapse sections
zh_hans: 收拢已展开模块

# review.daily.collect
source: Save appreciation card
zh_hans: 收藏赏析

# review.daily.collectDuplicate
source: This line is already in your library
zh_hans: 这句赏析已在词库中

# review.daily.collecting
source: Saving…
zh_hans: 收藏中…

# review.daily.collectNeedSentence
source: No sentence to save
zh_hans: 没有可收藏的句子

# review.daily.collectSuccess
source: Saved to Daily Lines deck
zh_hans: 赏析卡已加入「每日一句」词库

# review.daily.fromLibrary
source: From your library
zh_hans: 来自你的词库

# review.daily.history.empty
source: Lines you see on the home screen will gather here.
zh_hans: 首页出现过的句子会自动收录到这里。

# review.daily.history.link
source: Past lines
zh_hans: 查看往期句子

# review.daily.history.noMatch
source: No matching lines
zh_hans: 没有匹配的句子

# review.daily.history.search
source: Search lines
zh_hans: 搜索原文或译文

# review.daily.history.title
source: Past lines
zh_hans: 往期句子

# review.daily.preferences.active
source: Active
zh_hans: 当前偏好

# review.daily.preferences.clear
source: Reset to default
zh_hans: 恢复默认

# review.daily.preferences.custom
source: Custom
zh_hans: 自定义
